# IsDefaultWorkset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetPreview..::..IsDefaultWorkset Property
WorksetPreview Class See Also
---
Whether the workset is the default one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsDefaultWorkset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDefaultWorkset As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDefaultWorkset {
	bool get ();
}
```

# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace